tiborsimon/embedded-tdd-headers/pic/pic18/pic18f2685_tdd.h
#define B1SIDH_SID4                   1091
#define B1SID4                        1092
#define B1SIDH_SID5                   1093
#define B1SID5                        1094
#define B1SIDH_SID6                   1095
#define B1SID6                        1096
#define B1SIDH_SID7                   1097
#define B1SID7                        1098
#define B1SIDH_SID8                   1099
#define B1SID8                        1100
#define B1SIDH_SID9                   1101
#define B1SID9                        1102
#define B1SIDH_SID10                  1103
#define B1SID10                       1104
#define B1SIDL                        1105
#define B1EID16                       1106
#define B1SIDL_EID16                  1107
#define B1EID17                       1108
#define B1SIDL_EID17                  1109
#define B1SIDL_EXIDE                  1110
#define B1SIDL_EXID                   1111
#define B1EXID                        1112
#define B1SRR                         1113
#define B1SIDL_SRR                    1114
#define B1SIDL_SID0                   1115
#define B1SID0                        1116
#define B1SIDL_SID1                   1117
#define B1SID1                        1118
#define B1SIDL_SID2                   1119
#define B1SID2                        1120
#define B1EIDH                        1121
#define B1EID8                        1122
#define B1EIDH_EID8                   1123
#define B1EID9                        1124
#define B1EIDH_EID9                   1125
#define B1EIDH_EID10                  1126
#define B1EID10                       1127
#define B1EIDH_EID11                  1128
#define B1EID11                       1129
#define B1EIDH_EID12                  1130
#define B1EID12                       1131
#define B1EIDH_EID13                  1132
#define B1EID13                       1133
#define B1EIDH_EID14                  1134
#define B1EID14                       1135
#define B1EIDH_EID15                  1136
#define B1EID15                       1137
#define B1EIDL                        1138
#define B1EID0                        1139
#define B1EIDL_EID0                   1140
#define B1EID1                        1141
#define B1EIDL_EID1                   1142
#define B1EID2                        1143
#define B1EIDL_EID2                   1144
#define B1EID3                        1145
#define B1EIDL_EID3                   1146
#define B1EID4                        1147
#define B1EIDL_EID4                   1148
#define B1EID5                        1149
#define B1EIDL_EID5                   1150
#define B1EID6                        1151
#define B1EIDL_EID6                   1152
#define B1EIDL_EID7                   1153
#define B1EID7                        1154
#define B1DLC                         1155
#define B1DLC0                        1156
#define B1DLC_DLC0                    1157
#define B1DLC1                        1158
#define B1DLC_DLC1                    1159
#define B1DLC2                        1160
#define B1DLC_DLC2                    1161
#define B1DLC3                        1162
#define B1DLC_DLC3                    1163
#define B1RB0                         1164
#define B1DLC_RESRB0                  1165
#define B1DLC_RB0                     1166
#define B1RB1                         1167
#define B1DLC_RESRB1                  1168
#define B1DLC_RB1                     1169
#define B1DLC_RXRTR_TXRTR             1170
#define B1DLC_RXRTR                   1171
#define B1RXRTR                       1172
#define B1DLC_TXRTR                   1173
#define B1D0                          1174
#define B1D00                         1175
#define B1D01                         1176
#define B1D02                         1177
#define B1D03                         1178
#define B1D04                         1179
#define B1D05                         1180
#define B1D06                         1181
#define B1D07                         1182
#define B1D1                          1183
#define B1D10                         1184
#define B1D11                         1185
#define B1D12                         1186
#define B1D13                         1187
#define B1D14                         1188
#define B1D15                         1189
#define B1D16                         1190
#define B1D17                         1191
#define B1D2                          1192
#define B1D20                         1193
#define B1D21                         1194
#define B1D22                         1195
#define B1D23                         1196
#define B1D24                         1197
#define B1D25                         1198
#define B1D26                         1199
#define B1D27                         1200
#define B1D3                          1201
#define B1D30                         1202
#define B1D31                         1203
#define B1D32                         1204
#define B1D33                         1205
#define B1D34                         1206
#define B1D35                         1207
#define B1D36                         1208
#define B1D37                         1209
#define B1D4                          1210
#define B1D40                         1211
#define B1D41                         1212
#define B1D42                         1213
#define B1D43                         1214
#define B1D44                         1215
#define B1D45                         1216
#define B1D46                         1217
#define B1D47                         1218
#define B1D5                          1219
#define B1D50                         1220
#define B1D51                         1221
#define B1D52                         1222
#define B1D53                         1223
#define B1D54                         1224
#define B1D55                         1225
#define B1D56                         1226
#define B1D57                         1227
#define B1D6                          1228
#define B1D60                         1229
#define B1D61                         1230
#define B1D62                         1231
#define B1D63                         1232
#define B1D64                         1233
#define B1D65                         1234
#define B1D66                         1235
#define B1D67                         1236
#define B1D7                          1237
#define B1D70                         1238
#define B1D71                         1239
#define B1D72                         1240
#define B1D73                         1241
#define B1D74                         1242
#define B1D75                         1243
#define B1D76                         1244
#define B1D77                         1245
#define CANSTAT_RO8                   1246
#define CANSTAT_RO8_ICODE0            1247
#define CANSTAT_RO8_EICODE0           1248
#define CANSTAT_RO8_EICODE1_ICODE0    1249
#define CANSTAT_RO8_ICODE1            1250
#define CANSTAT_RO8_ICODE2            1251
#define CANSTAT_RO8_EICODE2_ICODE1    1252
#define CANSTAT_RO8_ICODE3            1253
#define CANSTAT_RO8_EICODE3_ICODE2    1254
#define CANSTAT_RO8_ICODE4            1255
#define CANSTAT_RO8_EICODE4           1256
#define CANSTAT_RO8_OPMODE0           1257
#define CANSTAT_RO8_OPMODE1           1258
#define CANSTAT_RO8_OPMODE2           1259
#define CANCON_RO8                    1260
#define CANCON_RO8_FP0                1261
#define CANCON_RO8_WIN0               1262
#define CANCON_RO8_WIN0_FP1           1263
#define CANCON_RO8_WIN1               1264
#define CANCON_RO8_WIN1_FP2           1265
#define CANCON_RO8_WIN2_FP3           1266
#define CANCON_RO8_WIN2               1267
#define CANCON_RO8_ABAT               1268
#define CANCON_RO8_REQOP0             1269
#define CANCON_RO8_REQOP1             1270
#define CANCON_RO8_REQOP2             1271
#define B2CON                         1272
#define B2FILHIT0                     1273
#define B2TXPRI0                      1274
#define B2CON_FILHIT0_TXPRI0          1275
#define B2CON_FILHIT0                 1276
#define B2CON_TXPRI0                  1277
#define B2FILHIT1                     1278
#define B2TXPRI1                      1279
#define B2CON_FILHIT1_TXPRI1          1280
#define B2CON_FILHIT1                 1281
#define B2CON_TXPRI1                  1282
#define B2CON_RTREN                   1283
#define B2FILHIT2                     1284
#define B2RTREN                       1285
#define B2CON_FILHIT2                 1286
#define B2CON_FILHIT2_RTREN           1287
#define B2FILHIT3                     1288
#define B2CON_FILHIT3                 1289
#define B2TXREQ                       1290
#define B2CON_FILHIT3_TXREQ           1291
#define B2CON_TXREQ                   1292
#define B2FILHIT4                     1293
#define B2CON_TXERR                   1294
#define B2CON_FILHIT4_TXERR           1295
#define B2CON_FILHIT4                 1296
#define B2TXERR                       1297
#define B2RTRRO                       1298
#define B2TXLARB                      1299
#define B2CON_TXLARB                  1300
#define B2CON_RXRTRRO_TXLARB          1301
#define B2CON_RXRTRRO                 1302
#define B2CON_RTRRO                   1303
#define B2TXABT                       1304
#define B2RXM1                        1305
#define B2CON_RXM1_TXABT              1306
#define B2CON_RXM1                    1307
#define B2CON_TXABT                   1308
#define B2TXB3IF                      1309
#define B2CON_TXBIF                   1310
#define B2CON_RXFUL                   1311
#define B2RXFUL                       1312
#define B2CON_RXFUL_TXBIF             1313
#define B2SIDH                        1314
#define B2SID3                        1315
#define B2SIDH_SID3                   1316
#define B2SID4                        1317
#define B2SIDH_SID4                   1318
#define B2SIDH_SID5                   1319
#define B2SID5                        1320
#define B2SID6                        1321
#define B2SIDH_SID6                   1322
#define B2SIDH_SID7                   1323
#define B2SID7                        1324
#define B2SIDH_SID8                   1325
#define B2SID8                        1326
#define B2SIDH_SID9                   1327
#define B2SID9                        1328
#define B2SID10                       1329
#define B2SIDH_SID10                  1330
#define B2SIDL                        1331
#define B2SIDL_EID16                  1332
#define B2EID16                       1333
#define B2SIDL_EID17                  1334
#define B2EID17                       1335
#define B2EXID                        1336
#define B2SIDL_EXIDE                  1337
#define B2SIDL_EXID                   1338
#define B2EXIDE                       1339
#define B2SRR                         1340
#define B2SIDL_SRR                    1341
#define B2SIDL_SID0                   1342
#define B2SID0                        1343
#define B2SIDL_SID1                   1344
#define B2SID1                        1345
#define B2SIDL_SID2                   1346
#define B2SID2                        1347
#define B2EIDH                        1348
#define B2EID8                        1349
#define B2EIDH_EID8                   1350
#define B2EID9                        1351
#define B2EIDH_EID9                   1352
#define B2EID10                       1353
#define B2EIDH_EID10                  1354
#define B2EID11                       1355
#define B2EIDH_EID11                  1356
#define B2EID12                       1357
#define B2EIDH_EID12                  1358
#define B2EID13                       1359
#define B2EIDH_EID13                  1360
#define B2EID14                       1361
#define B2EIDH_EID14                  1362
#define B2EID15                       1363
#define B2EIDH_EID15                  1364
#define B2EIDL                        1365
#define B2EID0                        1366
#define B2EIDL_EID0                   1367
#define B2EID1                        1368
#define B2EIDL_EID1                   1369
#define B2EID2                        1370
#define B2EIDL_EID2                   1371
#define B2EID3                        1372
#define B2EIDL_EID3                   1373
#define B2EID4                        1374
#define B2EIDL_EID4                   1375
#define B2EID5                        1376
#define B2EIDL_EID5                   1377
#define B2EID6                        1378
#define B2EIDL_EID6                   1379
#define B2EID7                        1380
#define B2EIDL_EID7                   1381
#define B2DLC                         1382
#define B2DLC0                        1383
#define B2DLC_DLC0                    1384
#define B2DLC1                        1385
#define B2DLC_DLC1                    1386
#define B2DLC2                        1387
#define B2DLC_DLC2                    1388
#define B2DLC3                        1389
#define B2DLC_DLC3                    1390
#define B2RB0                         1391
#define B2DLC_RESRB0                  1392
#define B2DLC_RB0                     1393
#define B2RB1                         1394
#define B2DLC_RESRB1                  1395
#define B2DLC_RB1                     1396
#define B2DLC_RXRTR_TXRTR             1397
#define B2DLC_RXRTR                   1398
#define B2RXRTR                       1399
#define B2DLC_TXRTR                   1400
#define B2D0                          1401
#define B2D00                         1402
#define B2D01                         1403
#define B2D02                         1404
#define B2D03                         1405
#define B2D04                         1406
#define B2D05                         1407
#define B2D06                         1408
#define B2D07                         1409
#define B2D1                          1410
#define B2D10                         1411
#define B2D11                         1412
#define B2D12                         1413
#define B2D13                         1414
#define B2D14                         1415
#define B2D15                         1416
#define B2D16                         1417
#define B2D17                         1418
#define B2D2                          1419
#define B2D20                         1420
#define B2D21                         1421
#define B2D22                         1422
#define B2D23                         1423
#define B2D24                         1424
#define B2D25                         1425
#define B2D26                         1426
#define B2D27                         1427
#define B2D3                          1428
#define B2D30                         1429
#define B2D31                         1430
#define B2D32                         1431
#define B2D33                         1432
#define B2D34                         1433
#define B2D35                         1434
#define B2D36                         1435
#define B2D37                         1436
#define B2D4                          1437
#define B2D40                         1438
#define B2D41                         1439
#define B2D42                         1440
#define B2D43                         1441
#define B2D44                         1442
#define B2D45                         1443
#define B2D46                         1444
#define B2D47                         1445
#define B2D5                          1446
#define B2D50                         1447
#define B2D51                         1448
#define B2D52                         1449
#define B2D53                         1450
#define B2D54                         1451
#define B2D55                         1452
#define B2D56                         1453
#define B2D57                         1454
#define B2D6                          1455
#define B2D60                         1456
#define B2D61                         1457
#define B2D62                         1458
#define B2D63                         1459
#define B2D64                         1460
#define B2D65                         1461
#define B2D66                         1462
#define B2D67                         1463
#define B2D7                          1464
#define B2D70                         1465
#define B2D71                         1466
#define B2D72                         1467
#define B2D73                         1468
#define B2D74                         1469
#define B2D75                         1470
#define B2D76                         1471
#define B2D77                         1472
#define CANSTAT_RO7                   1473
#define CANSTAT_RO7_ICODE0            1474
#define CANSTAT_RO7_EICODE0           1475
#define CANSTAT_RO7_ICODE1            1476
#define CANSTAT_RO7_EICODE1_ICODE0    1477
#define CANSTAT_RO7_EICODE2_ICODE1    1478
#define CANSTAT_RO7_ICODE2            1479
#define CANSTAT_RO7_EICODE3_ICODE2    1480
#define CANSTAT_RO7_ICODE3            1481
#define CANSTAT_RO7_ICODE4            1482
#define CANSTAT_RO7_EICODE4           1483
#define CANSTAT_RO7_OPMODE0           1484
#define CANSTAT_RO7_OPMODE1           1485
#define CANSTAT_RO7_OPMODE2           1486
#define CANCON_RO7                    1487
#define CANCON_RO7_FP0                1488
#define CANCON_RO7_WIN0               1489
#define CANCON_RO7_WIN0_FP1           1490
#define CANCON_RO7_WIN1_FP2           1491
#define CANCON_RO7_WIN1               1492
#define CANCON_RO7_WIN2_FP3           1493
#define CANCON_RO7_WIN2               1494
#define CANCON_RO7_ABAT               1495
#define CANCON_RO7_REQOP0             1496
#define CANCON_RO7_REQOP1             1497
#define CANCON_RO7_REQOP2             1498
#define B3CON                         1499
#define B3CON_TXPRI0                  1500
#define B3CON_FILHIT0                 1501
#define B3TXPRI0                      1502
#define B3CON_FILHIT0_TXPRI0          1503
#define B3FILHIT0                     1504
#define B3CON_FILHIT1                 1505
#define B3CON_TXPRI1                  1506
#define B3TXPRI1                      1507
#define B3FILHIT1                     1508
#define B3CON_FILHIT1_TXPRI1          1509
#define B3CON_FILHIT2                 1510
#define B3CON_FILHIT2_RTREN           1511
#define B3RTREN                       1512
#define B3FILHIT2                     1513
#define B3CON_RTREN                   1514
#define B3CON_FILHIT3_TXREQ           1515
#define B3TXREQ                       1516
#define B3CON_FILHIT3                 1517
#define B3FILHIT3                     1518
#define B3CON_TXREQ                   1519
#define B3CON_FILHIT4                 1520
#define B3CON_TXERR                   1521
#define B3CON_FILHIT4_TXERR           1522
#define B3TXERR                       1523
#define B3FILHIT4                     1524
#define B3CON_RTRRO                   1525
#define B3CON_RXRTRRO                 1526
#define B3CON_RXRTRRO_TXLARB          1527
#define B3CON_TXLARB                  1528
#define B3RTRRO                       1529
#define B3TXLARB                      1530
#define B3CON_RXM1                    1531
#define B3TXABT                       1532
#define B3CON_RXM1_TXABT              1533
#define B3CON_TXABT                   1534
#define B3RXM1                        1535
#define B3CON_RXFUL_TXBIF             1536
#define B3RXFUL                       1537
#define B3CON_TXBIF                   1538
#define B3TXB3IF                      1539
#define B3CON_RXFUL                   1540
#define B3SIDH                        1541
#define B3SIDH_SID3                   1542
#define B3SID3                        1543
#define B3SIDH_SID4                   1544
#define B3SID4                        1545
#define B3SIDH_SID5                   1546
#define B3SID5                        1547
#define B3SIDH_SID6                   1548
#define B3SID6                        1549
#define B3SIDH_SID7                   1550
#define B3SID7                        1551
#define B3SIDH_SID8                   1552
#define B3SID8                        1553
#define B3SIDH_SID9                   1554
#define B3SID9                        1555
#define B3SID10                       1556
#define B3SIDH_SID10                  1557
#define B3SIDL                        1558
#define B3EID16                       1559
#define B3SIDL_EID16                  1560
#define B3EID17                       1561
#define B3SIDL_EID17                  1562
#define B3EXIDE                       1563
#define B3SIDL_EXIDE                  1564
#define B3SIDL_EXID                   1565
#define B3EXID                        1566
#define B3SIDL_SRR                    1567
#define B3SRR                         1568
#define B3SIDL_SID0                   1569
#define B3SID0                        1570
#define B3SIDL_SID1                   1571
#define B3SID1                        1572
#define B3SIDL_SID2                   1573
#define B3SID2                        1574
#define B3EIDH                        1575
#define B3EID8                        1576
#define B3EIDH_EID8                   1577
#define B3EID9                        1578
#define B3EIDH_EID9                   1579
#define B3EIDH_EID10                  1580
#define B3EID10                       1581
#define B3EIDH_EID11                  1582
#define B3EID11                       1583
#define B3EIDH_EID12                  1584
#define B3EID12                       1585
#define B3EIDH_EID13                  1586
#define B3EID13                       1587
#define B3EIDH_EID14                  1588
#define B3EID14                       1589
#define B3EIDH_EID15                  1590
#define B3EID15                       1591
#define B3EIDL                        1592
#define B3EID0                        1593
#define B3EIDL_EID0                   1594
#define B3EID1                        1595
#define B3EIDL_EID1                   1596
#define B3EID2                        1597
#define B3EIDL_EID2                   1598
#define B3EID3                        1599
#define B3EIDL_EID3                   1600
#define B3EID4                        1601
#define B3EIDL_EID4                   1602
#define B3EID5                        1603
#define B3EIDL_EID5                   1604
#define B3EID6                        1605
#define B3EIDL_EID6                   1606
#define B3EID7                        1607
#define B3EIDL_EID7                   1608
#define B3DLC                         1609
#define B3DLC_DLC0                    1610
#define B3DLC0                        1611
#define B3DLC_DLC1                    1612
#define B3DLC1                        1613
#define B3DLC_DLC2                    1614
#define B3DLC2                        1615
#define B3DLC_DLC3                    1616
#define B3DLC3                        1617
#define B3DLC_RB0                     1618
#define B3DLC_RESRB0                  1619
#define B3RB0                         1620
#define B3DLC_RB1                     1621
#define B3DLC_RESRB1                  1622
#define B3RB1                         1623
#define B3DLC_TXRTR                   1624
#define B3RXRTR                       1625
#define B3DLC_RXRTR                   1626
#define B3DLC_RXRTR_TXRTR             1627
#define B3D0                          1628
#define B3D00                         1629
#define B3D01                         1630
#define B3D02                         1631
#define B3D03                         1632
#define B3D04                         1633
#define B3D05                         1634
#define B3D06                         1635
#define B3D07                         1636
#define B3D1                          1637
#define B3D10                         1638
#define B3D11                         1639
#define B3D12                         1640
#define B3D13                         1641
#define B3D14                         1642
#define B3D15                         1643
#define B3D16                         1644
#define B3D17                         1645
#define B3D2                          1646
#define B3D20                         1647
#define B3D21                         1648
